// 账号，密码校验：英文字符（不区分大小写），数字，特殊符号
let accountNumber = /^[0-9a-zA-Z~!@#$%^&*()_+<>?:"{},./;'[|]*$/;
// mac地址校验：英文字符（不区分大小写），数字，-

let macAddress = /(^[A-F0-9]{2}([-][A-F0-9]{2}){5}$)|(^[A-F0-9]{2}([/][A-F0-9]{2}){5}$)|(^[A-F0-9]{2}([:][A-F0-9]{2}){5}$)|(^[A-F0-9]{2}([.][A-F0-9]{2}){5}$)|(^[A-F0-9]{2}([ ][A-F0-9]{2}){5}$)|(^[A-F0-9]{4}([-][A-F0-9]{4}){2}$)|(^[A-F0-9]{4}([/][A-F0-9]{4}){2}$)|(^[A-F0-9]{4}([:][A-F0-9]{4}){2}$)|(^[A-F0-9]{4}([.][A-F0-9]{4}){2}$)|(^[A-F0-9]{4}([ ][A-F0-9]{4}){2}$)/i;

// let macAddress = /^[A-F0-9]{2}$)/i;

// 登录账号校验：英文字符（不区分大小写），数字，特殊符号(@-_.)
let loginAccount = /^[0-9a-zA-Z@\-_.]*$/;
// 手机号校验规则
let phoneNumber = /^[1][3,4,5,6,7,8,9][0-9]{9}$/;
// 校验码
// let verifyCode = /^[A-Za-z0-9]{m,n}$/;
let verifyCode = /^\d{6}$/;

// 邮箱验证
let verifyEmail = /^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/;

export default {
  accountNumber,
  macAddress,
  loginAccount,
  phoneNumber,
  verifyCode,
  verifyEmail
};
